from the instance creation log, the config_drive was enabled for control/worker/edge node;
from the curl command timeout on control/work/edge node, it looks like metadata service is disabled on openstack side.

**but how it could make difference of node label for topology between control node and worker/edge node, e.g. control node with "topology.cinder.csi.openstack.org/zone":"tys1-ovs-zone3"; but worker/edge nodes with "topology.cinder.csi.openstack.org/zone":""??**

2020-04-28 15:21:40,605 DEBUG:   # module.csd-worker-02.openstack_compute_instance_v2.instance will be created
2020-04-28 15:21:40,605 DEBUG:   + resource "openstack_compute_instance_v2" "instance" {
2020-04-28 15:21:40,605 DEBUG:       + access_ip_v4        = (known after apply)
2020-04-28 15:21:40,605 DEBUG:       + access_ip_v6        = (known after apply)
2020-04-28 15:21:40,606 DEBUG:       + all_metadata        = (known after apply)
2020-04-28 15:21:40,606 DEBUG:       + all_tags            = (known after apply)
2020-04-28 15:21:40,606 DEBUG:       + availability_zone   = "tys1-ovs-zone3"
2020-04-28 15:21:40,606 DEBUG:       + config_drive        = true
2020-04-28 15:21:40,606 DEBUG:       + flavor_id           = "4cd233f8-ae3c-4fa8-82a8-0d2f3217cd6a"
2020-04-28 15:21:40,606 DEBUG:       + flavor_name         = (known after apply)
2020-04-28 15:21:40,606 DEBUG:       + force_delete        = false
2020-04-28 15:21:40,606 DEBUG:       + id                  = (known after apply)
2020-04-28 15:21:40,606 DEBUG:       + image_id            = "f7b11205-1dd4-4f2f-8d48-82e717a222bf"
2020-04-28 15:21:40,606 DEBUG:       + image_name          = (known after apply)
2020-04-28 15:21:40,606 DEBUG:       + key_pair            = "csd-csd"
2020-04-28 15:21:40,606 DEBUG:       + metadata            = {
2020-04-28 15:21:40,606 DEBUG:           + "dc"       = "openstack"
2020-04-28 15:21:40,606 DEBUG:           + "role"     = "worker"
2020-04-28 15:21:40,606 DEBUG:           + "ssh_user" = "cloud-user"
2020-04-28 15:21:40,606 DEBUG:         }


2020-04-28 15:21:40,572 DEBUG:   # module.csd-edge-02.openstack_compute_instance_v2.instance will be created
2020-04-28 15:21:40,572 DEBUG:   + resource "openstack_compute_instance_v2" "instance" {
2020-04-28 15:21:40,572 DEBUG:       + access_ip_v4        = (known after apply)
2020-04-28 15:21:40,572 DEBUG:       + access_ip_v6        = (known after apply)
2020-04-28 15:21:40,572 DEBUG:       + all_metadata        = (known after apply)
2020-04-28 15:21:40,573 DEBUG:       + all_tags            = (known after apply)
2020-04-28 15:21:40,573 DEBUG:       + availability_zone   = "tys1-ovs-zone3"
2020-04-28 15:21:40,573 DEBUG:       + config_drive        = true
2020-04-28 15:21:40,573 DEBUG:       + flavor_id           = "6ad99553-a243-4a2b-a18c-07a5547c2c3a"
2020-04-28 15:21:40,573 DEBUG:       + flavor_name         = (known after apply)
2020-04-28 15:21:40,573 DEBUG:       + force_delete        = false
2020-04-28 15:21:40,573 DEBUG:       + id                  = (known after apply)
2020-04-28 15:21:40,573 DEBUG:       + image_id            = "f7b11205-1dd4-4f2f-8d48-82e717a222bf"
2020-04-28 15:21:40,573 DEBUG:       + image_name          = (known after apply)
2020-04-28 15:21:40,574 DEBUG:       + key_pair            = "csd-csd"
2020-04-28 15:21:40,574 DEBUG:       + metadata            = {
2020-04-28 15:21:40,574 DEBUG:           + "dc"       = "openstack"
2020-04-28 15:21:40,574 DEBUG:           + "role"     = "edge"
2020-04-28 15:21:40,574 DEBUG:           + "ssh_user" = "cloud-user"
2020-04-28 15:21:40,574 DEBUG:         }


2020-04-28 15:21:40,541 DEBUG:   # module.csd-control-03.openstack_compute_instance_v2.instance will be created
2020-04-28 15:21:40,541 DEBUG:   + resource "openstack_compute_instance_v2" "instance" {
2020-04-28 15:21:40,542 DEBUG:       + access_ip_v4        = (known after apply)
2020-04-28 15:21:40,542 DEBUG:       + access_ip_v6        = (known after apply)
2020-04-28 15:21:40,542 DEBUG:       + all_metadata        = (known after apply)
2020-04-28 15:21:40,542 DEBUG:       + all_tags            = (known after apply)
2020-04-28 15:21:40,542 DEBUG:       + availability_zone   = "tys1-ovs-zone3"
2020-04-28 15:21:40,542 DEBUG:       + config_drive        = true
2020-04-28 15:21:40,542 DEBUG:       + flavor_id           = "e1295d41-07a5-4a01-b146-6d81f585259f"
2020-04-28 15:21:40,542 DEBUG:       + flavor_name         = (known after apply)
2020-04-28 15:21:40,542 DEBUG:       + force_delete        = false
2020-04-28 15:21:40,542 DEBUG:       + id                  = (known after apply)
2020-04-28 15:21:40,542 DEBUG:       + image_id            = "f7b11205-1dd4-4f2f-8d48-82e717a222bf"
2020-04-28 15:21:40,542 DEBUG:       + image_name          = (known after apply)
2020-04-28 15:21:40,542 DEBUG:       + key_pair            = "csd-csd"
2020-04-28 15:21:40,542 DEBUG:       + metadata            = {
2020-04-28 15:21:40,543 DEBUG:           + "dc"       = "openstack"
2020-04-28 15:21:40,543 DEBUG:           + "role"     = "control edge"
2020-04-28 15:21:40,543 DEBUG:           + "ssh_user" = "cloud-user"
2020-04-28 15:21:40,543 DEBUG:         }

